export default {
	meta: {
		index: {
			title: 'Раман Майер - Dead end developer',
			description: 'full stack web распрацоўшчык web-распрацоўка php laravel javascript nuxt vue'
		}
	},

	name: 'Раман Майер',
	full_name: 'Раман Уладзіміравіч Майер',
	post: 'Dead end web распрацоўшчык',
	address: 'Букстэхудэ, Ніжняя Саксонія, Германія',
	date_of_birth: '9 лютага 1991',
	place_of_birth: 'Славянка, Прыморскі край, Расія',

	back_to_top: 'Наверх',
	certificate: 'Сертыфікат',
	copyright: '&copy; 2021 Roman Meyer',
	page_not_found: 'Старонка не існуе',
	go_home: 'На галоўную',

	cv: {
		download: 'Сьцягнуць рэзюмэ'
	},

	sections: {
		bio: 'Пра мяне',
		skills: 'Навыкі',
		languages: 'Мовы',
		work: 'Праца',
		education: 'Адукацыя',
		testimonials: 'Рэкамендацыі',
		clients: 'Кліенты',
		contacts: 'Кантакты',
		projects: 'Праекты'
	},

	bio: {
		about:
			'<p>Прывітанне. Мяне клічуць Раман. Я ўжо больш за дванаццаць гадоў займаюся вэб-распрацоўкай.</p><p>Свой першы мільён я зарабіў у 17 гадоў, яшчэ да таго, як перайшоў да сваёй бягучай дзейнасці. Праўда, гэты мільён быў не еўра і не долараў, а беларускіх рублёў, таму зарабіць яго было нескладана. Я проста рабіў курсавыя працы на Delphi і C/C++ сваім аднагрупнікам у каледжы. Гэта было ў перыяд атрымання маёй першай адукацыі, дзе я набыў спецыяльнасць "тэхнік-праграміст".</p><p>Пасля каледжа я ўладкаваўся на працу, дзе не трэба было асабліва напружвацца і я спакойна ўцягнуўся ў свет вэба. Паралельна з гэтым я атрымліваў бессэнсоўную вышэйшую адукацыю, абы толькі не ісці ў войска.</p><p>Тры гады сядзення ў некамфортным памяшканні і прагляду серыялаў парадкам надакучылі мне і я звольніўся. Мой іншы даход удвая пераўзыходзіў заробак, так што я мог сабе дазволіць проста перайсці на фрыланс.</p><p>Пачаўшы ў 2010-м годзе з голага PHP, я атрымаў шмат досведу з Joomla, Wordpress, MODx, Prestashop, Opencart і нават 1С-Бітрыкс, і нарэшце перайшоў да фрэймворкаў. Апошнім часам я актыўна пісаў на Laravel, адкрыў для сябе Nuxt.js і Tailwind, а цяпер займаюся пераважна франтэндам, выкарыстоўваючы ўсе папулярныя фрэймворкі.</p>',
		full_name: 'Поўнае імя',
		location: 'Месцазнаходжанне',
		date_of_birth: 'Дата нараджэння',
		place_of_birth: 'Месца нараджэння',
		phone: 'Тэлефон',
		email: 'E-mail'
	},

	skills: {
		php:
			'Веданне PHP (plain PHP, Phalcon, Laravel, павярхоўна Sylex i Lumen). Цяпер пераважна працую з Laravel.',
		js:
			'Веданне JavaScript (plain JS, jQuery‚ Vue.js/Vuex/Nuxt.js, Alpine, Svelte, React, Qwik, Electron, Node/Express), TypeScript',
		html: 'Веданне HTML, CSS (SASS, SCSS, Stylus), уменне вярстаць (Bootstrap, Tailwind).',
		delphi: 'Веданне Delphi 7, Pascal.',
		python: 'Веданне Python на ўзроўні рашэння прыкладных задач.',

		cms:
			'Вопыт працы з CMS Joomla, MODX, Drupal, Opencart, 1С-Битрикс, Prestashop, Wordpress i кучай самаробак.',
		db: 'Вопыт працы з базамі дадзеных (MySQL‚ Postgres, Informix‚ dBase, Mongo)‚ веданне SQL.',
		testing: 'Вопыт аўтаматычнага тэсціравання (Jest, Mocha, Cypress, Playwright).',
		deploy: 'Вопыт у CI/CD (Github, Gitlab, Bitbucket, AWS).',
		environment:
			'Вопыт усталёўкі і налады асяроддзя для вэб-распрацоўкі (Homestead, PHP, MySQL, Apache, Nginx, Docker) на Windows i Unix.',
		win: 'Вопыт стварэння прыкладанняў для Windows 8 (HTML+JS).',
		winphone: 'Вопыт стварэння мабільных прыкладанняў для Windows Phone 8 (HTML+JS, XAML+C#).',

		oop: 'Разуменне прынцыпаў ААП, MVC, шаблонаў праектавання.',
		coding:
			'Уменне разбірацца ў чужым кодзе, звычка пісаць самадакументаваны код i дадаваць каментары там, дзе яны сапраўды патрэбныя.',
		vcs: 'Уменне працаваць з сістэмамі кантролю версій.',
		algorithm: 'Разуменне алгарытмізацыі, структур дадзеных, ацэнкі складанасці алгарытмаў.',
		spaghetti: 'Уменне зразумець i адрэфактарыць любы спагеццi-код.',
		learn: 'Хуткая навучальнасць.'
	},

	languages: {
		reading: 'Чытанне',
		writing: 'Напісанне',
		listening: 'Аўдзіраванне',
		speaking: 'Гаварэнне',
		ru: {
			name: 'Руская',
			description: 'Родная мова. З ёй у мяне ніякіх праблем няма.'
		},
		by: {
			name: 'Беларуская',
			description:
				'Таксама родная, але па-за школай я ніколі яе не практыкаваў. Казаць на ёй зараз цяжкавата.'
		},
		ua: {
			name: 'Украінская',
			description:
				'З-за падабенства з рускай i беларускай разумею ўсё выдатна. Але пісаць i казаць магу ледзь-ледзь.'
		},
		en: {
			name: 'Англійская',
			description:
				'Вучу гадоў з пяці, асаблівых цяжкасцяў не адчуваю. Ёсць некаторая блытаніна з часам, але гэта не крытычна.'
		},
		de: {
			name: 'Нямецкая',
			description:
				'Вучу тры гады, пераважна самастойна. Практыкую кожны дзень. Складанасці ёсць толькі з выказваннем сваіх думак.'
		},
		pl: {
			name: 'Польская',
			description:
				'Чую з дзяцінства, так што разумею ўсё амаль ідэальна. Пішу агідна з-за асаблівасцяў граматыкі, кажу ніжэй за сярэдні.'
		},
		es: {
			name: 'Іспанская',
			description: 'Новы выклік для мяне.'
		}
	},

	work: {
		svitanak: {
			time: 'Жнівень 2010 - кастрычнік 2013',
			post: 'Інжынер-праграміст',
			firm: 'ААТ Світанак',
			location: 'г. Жодзіна, Беларусь',
			description:
				'Тут я пачаў працаваць па размеркаванні адразу пасля каледжа. Праца складалася ў аўтаматызацыі розных працэсаў у рамках буйной швейнай вытворчасці. У асноўным я дапамагаў аддзелам маркетынгу, фінансаў i інтэрнатаў, пісаў для іх прыкладны софт на Delphi 7. Зэканоміў людзям шмат часу. Першы час я працаваў з энтузіязмам, але неўзабаве стала ясна, што дзяржаўнае прадпрыемства не зацікаўлена ў тлумачальных спецыялістах, i я проста глядзеў серыялы i займаўся сваімі справамі. Звольніўся, бо надакучыла рана ўставаць i мерзнуць у дрэнна ацяпляным памяшканні.'
		},
		itgarant: {
			time: 'Лістапад 2013 - снежань 2015',
			post: 'Full stack web-распрацоўшчык',
			firm: 'ITGarant',
			location: 'г. Мінск, Беларусь',
			description:
				'Рабіў пад ключ сайты на Joomla, пісаў кастамныя кампаненты для гэтай CMS. Адзін з праектаў выйграў Russian Developers Cup 2014 ад Mail.ru group. Акрамя таго, трапляліся праекты на Drupal i шмат самапісных сайтаў, якія патрабавалі дробных правак. Таксама рабіў нескладанае мабільнае прыкладанне пад Windows 8.'
		},
		freelance: {
			time: 'Студзень 2016 - чэрвень 2018',
			post: 'Full stack web-распрацоўшчык',
			firm: 'Фрыланс',
			location: '',
			description:
				'Гэты перыяд быў самым бесклапотным, але ў той жа час i небяспечным, бо мог моцна мяне расслабіць. Я супрацоўнічаў з некалькімі арганізацыямі ў СНД i атрымаў тону досведу. Больш за ўсё траплялася заказаў на 1С-Бітрыкс. Вельмі шмат займаўся парсінгам спецыфічных дадзеных у рамках супрацоўніцтва з адной буйной фірмай.'
		},
		recoma: {
			time: 'Ліпень 2018 - жнівень 2021',
			post: 'Full stack web-распрацоўшчык',
			firm: 'RECO.MA GmbH',
			location: 'Безеліх, Германія',
			description:
				'Атрымаў прапанову пераехаць у Нямеччыну i не разважаў. Рабіў некалькі буйных i амбіцыйных праектаў на Laravel, паралельна абслугоўваў пару сайтыкаў на Wordpress i пісаў кастомныя карыстацкія інтэрфейсы.'
		},
		vke: {
			time: 'Верасень 2021 - жнівень 2022',
			post: 'Full stack web-распрацоўшчык',
			firm: 'von Kéler Engineering GmbH',
			location: 'Браўншвейг, Германія',
			description:
				'Стаў часткай каманды вэб-распрацоўшчыкаў. Спачатку займаўся ўнутранымі праектамі кампаніі, а потым рабіў цікавую штуку на React у Electron. Акрамя гэтага, прымаў удзел у дапрацоўцы нізкаўзроўневай праграмы для Siemens.'
		},
		pixelpark: {
			time: 'Верасень 2022 - па цяперашні час',
			post: 'Full stack web-распрацоўшчык',
			firm: 'Digitas Pixelpark GmbH',
			location: 'Кёльн, Германія',
			description: 'Далучыўся да вялікай каманды, якая займаецца буйнымі вэб-праектамі.'
		}
	},

	education: {
		bscli: {
			time: '2006 - 2010',
			speciality: 'Праграмнае забеспячэнне інфармацыйных тэхналогій',
			post: 'Тэхнік-праграміст',
			name: 'Баранавіцкі дзяржаўны каледж лёгкай прамысловасці ім. У.Я. Чарнышова',
			location: 'г. Баранавічы, Беларусь'
		},
		grsu: {
			time: '2010 - 2015',
			speciality: 'Праграмнае забеспячэнне інфармацыйных тэхналогій',
			post: 'Інжынер-праграміст',
			name: 'Гродзенскі дзяржаўны ўніверсітэт ім. Я. Купалы',
			location: 'г. Гродна, Беларусь'
		}
	},

	projects: {
		randby: {
			name: 'Rand.by',
			description:
				'Прасценькі сэрвіс для генерацыі ўсякіх выпадковых значэнняў. Не так даўно знайшоў час, нарэшце перапісаў праект з чыстага JS у Nuxt, а таксама прымайстраваў адчыненае API, напісанае на Express. Сам рэгулярна карыстаюся генератарам пароляў.'
		},
		kinda: {
			name: 'Нешта накшталт блога',
			description:
				'Мой асабісты тэматычны блог. Ён вузкапрофільны, ствараўся выключна для зручнасці распаўсюджвання сярод сяброў і знаёмых. Па статыстыцы бачу, што людзі знаходзяць і чытаюць. Доўгі час планую глабальныя пераробкі, каб было зручней адміністраваць пасты.'
		},
		blurhash: {
			name: 'BlurHash дэма',
			description:
				'Для прэзентацыі на працы трэба было паказаць, што такое blurhash, як яго выкарыстоўваць і якія ў яго ёсць альтэрнатывы. Для гэтага вырашыў зрабіць дэма-праект і заадно выкарыстаць свежую версію Nuxt. Там унутры акрамя дэма ёсць яшчэ канвэртар.'
		},
		debtcalc: {
			name: 'Калькулятар даўгоў',
			description:
				'Вэб-прыкладання для разліку даўгоў у групах. Часта ў паездках узнікае блытаніна, хто каму і колькі грошай у выніку вінен. Каб не лічыць гэта ўсё на паперцы ці ў Excel, рэалізаваў калькулятар на React.'
		},
		travelcalc: {
			name: 'Калькулятар вандроўцы',
			description:
				'Яшчэ адна рэч, патрэбная ў паездках. Дазваляе хутка канвертаваць кошты ў замежнай валюце ў звыклую, а яшчэ можа паказаць, колькі гадзін трэба працаваць для здзяйснення якой-небудзь пакупкі. Рэалізавана на Qwik з інтэграцыяй некалькіх React-кампанентаў.'
		}
	},

	contacts: {
		form: {
			name: 'Ваша імя',
			email: 'Ваш электронны адрас',
			comment: 'Тэкст паведамлення',
			required: 'Абавязковае поле',
			send: 'Адправіць паведамленне',
			sending: 'Адпраўляецца...',
			success: 'Ваша паведамленне паспяхова даслана',
			error: 'Нешта пайшло не так'
		}
	},

	validation: {
		alpha: 'Поле можа змяшчаць толькі літары',
		alpha_spaces: 'Поле можа змяшчаць толькі літары i прабелы',
		email: 'Поле павінна быць сапраўдным электронным адрасам',
		min: 'Поле павінна быць не менш {length} сімвалаў',
		required: 'Поле абавязкова для запаўнення'
	},

	ua: {
		disclaimer:
			'24 лютага 2022 года карлікавая брыдота па прозвішчы Пуцін развязала і пры дапамозе вусатага ўблюдка Лукашэнка вядзе вайну супраць Украіны. Яны знішчаюць украінскія гарады, забіваюць і гвалцяць мірнае насельніцтва, марадзёрствуюць і ядуць сабак. Украіна выстаіць, але ім патрэбна ваша дапамога.',
		support: 'Падтрымаць Украіну'
	}
};
