export default {
  meta: {
    index: {
      title: 'Роман Бобрик - Dead end developer',
      description: 'full stack web разработчик web-разработка php laravel javascript nuxt vue',
    },
  },

  name: 'Роман Бобрик',
  full_name: 'Роман Владимирович Бобрик',
  post: 'Dead end web разработчик',
  address: 'Букстехуде, Нижняя Саксония, Германия',
  date_of_birth: '9 февраля 1991',
  place_of_birth: 'Славянка, Приморский край, Россия',

  back_to_top: 'Наверх',

  cv: {
    download: 'Скачать резюме',
  },

  sections: {
    bio: 'Обо мне',
    skills: 'Навыки',
    languages: 'Языки',
    experience: 'Опыт работы',
    education: 'Образование',
    testimonials: 'Рекомендации',
    clients: 'Клиенты',
    contacts: 'Контакты',
  },

  bio: {
    about: '<p>Привет. Меня зовут Роман. Я уже больше десяти лет занимаюсь веб-разработкой.</p><p>Свой первый миллион я заработал в 17 лет, еще до того, как перешел к своей текущей деятельности. Правда, этот миллион был не евро и не долларов, а белорусских рублей, так что заработать его было несложно. Я просто делал курсовые работы на Delphi и C/C++ своим одногруппникам в колледже. Это было в период получения моего первого образования, где я приобрел специальность "техник-программист".</p><p>После коллежда я устроился на работу, где не нужно было особенно напрягаться и я спокойно втянулся в мир веба. Параллельно с этим я получал бессмысленное высшее образование, лишь бы только не идти в армию.</p><p>Три года сидения в некомфортном помещении и просмотра сериалов порядком надоели мне и я уволился. Мой сторонний доход вдвое превосходил зарплату, так что я мог себе позволить просто перейти на фриланс.</p><p>Начав в 2010-м году с голого PHP, я получил много опыта с Joomla, Wordpress, MODx, Prestashop, Opencart и даже 1С-Битрикс, и наконец перешел к фреймворкам. Последние три года я активно пишу на Laravel, а недавно открыл для себя Nuxt.js и Tailwind.</p>',
    full_name: 'Полное имя',
    location: 'Местоположение',
    date_of_birth: 'Дата рождения',
    place_of_birth: 'Место рождения',
    phone: 'Телефон',
    email: 'E-mail',
  },

  skills: {
    php: 'Знание PHP (plain php, Phalcon, Laravel, поверхностно Sylex и Lumen). Сейчас преимущественно работаю с Laravel.',
    js: 'Знание JavaScript (plain js, jQuery‚ Vue.js/Vuex/Nuxt.js, Alpine).',
    html: 'Знание HTML, CSS, умение верстать (Bootstrap, Tailwind).',
    delphi: 'Знание Delphi 7, Pascal.',
    python: 'Знание Python на уровне решения прикладных задач.',

    cms: 'Опыт работы с CMS Joomla, MODX, Opencart, 1С-Битрикс, Prestashop, Wordpress.',
    db: 'Опыт работы с базами данных (MySQL‚ Informix‚ dBase)‚ знание SQL.',
    environment: 'Опыт установки и настройки окружения для веб-разработки (Homestead, PHP, MySQL, Apache, Nginx) на Windows и Unix.',
    win: 'Опыт создания приложений для Windows 8 (HTML+JS).',
    winphone: 'Опыт создания мобильных приложений для Windows Phone 8 (HTML+JS, XAML+C#).',

    oop: 'Понимание принципов ООП, MVC, шаблонов проектирования.',
    coding: 'Умение разбираться в чужом коде‚ привычка писать самодокументированный код и добавлять комментарии там, где они действительно нужны.',
    vcs: 'Умение работать с системами контроля версий.',
    algorithm: 'Понимание алгоритмизации‚ структур данных‚ оценки сложности алгоритмов.',
    spaghetti: 'Умение понять и отрефакторить любой спагетти-код.',
    learn: 'Быстрая обучаемость.',
  },

  languages: {
    reading: 'Чтение',
    writing: 'Письмо',
    listening: 'Аудирование',
    speaking: 'Говорение',
    ru: {
      name: 'Русский',
      description: 'Родной язык. С ним у меня никаких проблем нет.',
    },
    by: {
      name: 'Белорусский',
      description: 'Тоже родной, но вне школы я никогда его не практиковал. Говорить на нем сейчас сложновато.',
    },
    ua: {
      name: 'Украинский',
      description: 'В силу схожести с русским и белорусским понимаю все отлично. Но писать и говорить могу едва-едва.',
    },
    en: {
      name: 'Английский',
      description: 'Учу лет с пяти, особых трудностей не испытываю. Есть некоторая путаница с временами, но это не критично.',
    },
    de: {
      name: 'Немецкий',
      description: 'Учу три года, преимущественно самостоятельно. Практикую каждый день. Сложности есть только с выражением своих мыслей.',
    },
    pl: {
      name: 'Польский',
      description: 'Слышу с детства, так что понимаю все почти идеально. Пишу отвратительно из-за особенностей грамматики, говорю ниже среднего.',
    },
  },
}
