export default {
  meta: {
    index: {
      title: 'Роман Бобрик - Dead end developer',
      description: 'full stack web разработчик web-разработка php laravel javascript nuxt vue',
    },
  },

  name: 'Роман Бобрик',
  full_name: 'Роман Владимирович Бобрик',
  post: 'Dead end web разработчик',
  address: 'Букстехуде, Нижняя Саксония, Германия',
  date_of_birth: '9 февраля 1991',
  place_of_birth: 'Славянка, Приморский край, Россия',

  cv: {
    download: 'Скачать резюме',
  },

  sections: {
    bio: 'Обо мне',
    skills: 'Навыки',
    experience: 'Опыт работы',
    education: 'Образование',
    testimonials: 'Рекомендации',
    clients: 'Клиенты',
    contacts: 'Контакты',
  },

  bio: {
    about: '<p>Привет. Меня зовут Роман. Я уже больше десяти лет занимаюсь веб-разработкой.</p><p>Свой первый миллион я заработал в 17 лет, еще до того, как перешел к своей текущей деятельности. Правда, этот миллион был не евро и не долларов, а белорусских рублей, так что заработать его было несложно. Я просто делал курсовые работы на Delphi и C/C++ своим одногруппникам в колледже. Это было в период получения моего первого образования, где я приобрел специальность "техник-программист".</p><p>После коллежда я устроился на работу, где не нужно было особенно напрягаться и я спокойно втянулся в мир веба. Параллельно с этим я получал бессмысленное высшее образование, лишь бы только не идти в армию.</p><p>Три года сидения в некомфортном помещении и просмотра сериалов порядком надоели мне и я уволился. Мой сторонний доход вдвое превосходил зарплату, так что я мог себе позволить просто перейти на фриланс.</p><p>Начав в 2010-м году с голого PHP, я получил много опыта с Joomla, Wordpress, MODx, Prestashop, Opencart и даже 1С-Битрикс, и наконец перешел к фреймворкам. Последние три года я активно пишу на Laravel, а недавно открыл для себя Nuxt.js и Tailwind.</p>',
    full_name: 'Полное имя',
    location: 'Местоположение',
    date_of_birth: 'Дата рождения',
    place_of_birth: 'Место рождения',
    phone: 'Телефон',
    email: 'E-mail',
  }
}
